---
title: ViewDisplaySketchyLines
classe: Autodesk.Revit.DB.ViewDisplaySketchyLines
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# ViewDisplaySketchyLines

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean EnableSketchyLines { get; set; }` | `viewDisplaySketchyLines.EnableSketchyLines` | Boolean |
| `Int32 Extension { get; set; }` | `viewDisplaySketchyLines.Extension` | Int32 |
| `Boolean IsValidObject { get; }` | `viewDisplaySketchyLines.IsValidObject` | Boolean |
| `Int32 Jitter { get; set; }` | `viewDisplaySketchyLines.Jitter` | Int32 |
| `Void Dispose()` | `viewDisplaySketchyLines.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```